tokihk/sdbox/env/nxp_mimxrt1170_evkb/system_sdsgw_m7/codec/fsl_wm8962.c
/*
 * Copyright 2022-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_wm8962.h"

/*******************************************************************************
 * Definitations
 ******************************************************************************/
#define WM8962_CHECK_RET(x, status)  \
    (status) = (x);                  \
    if ((status) != kStatus_Success) \
    {                                \
        return (status);             \
    }
/*! @brief WM8962 max clock */
#define WM8962_MAX_DSP_CLOCK (24576000U)
#define WM8962_MAX_SYS_CLOCK (12288000U)
/*! @brief WM8962 f2 better performance range */
#define WM8962_FLL_VCO_MIN_FREQ 90000000U
#define WM8962_FLL_VCO_MAX_FREQ 100000000U
#define WM8962_FLL_LOCK_TIMEOUT 10000000U
/*! @brief WM8962 FLLN range */
#define WM8962_FLL_N_MIN_VALUE              6U
#define WM8962_FLL_N_MAX_VALUE              12U
#define WM8962_FLL_MAX_REFERENCE_CLOCK      (13500000U)
#define WM8962_SWAP_UINT16_BYTE_SEQUENCE(x) ((((x)&0x00ffU) << 8U) | (((x)&0xff00U) >> 8U))
/*! @brief WM8962 default sequence */
typedef enum _wm8962_sequence_id
{
    kWM8962_SequenceDACToHeadphonePowerUp = 0x80U, /*!< dac to headphone power up sequence */
    kWM8962_SequenceAnalogueInputPowerUp  = 0x92U, /*!< Analogue input power up sequence */
    kWM8962_SequenceChipPowerDown         = 0x9BU, /*!< Chip power down sequence */
    kWM8962_SequenceSpeakerSleep          = 0xE4U, /*!< Speaker sleep sequence */
    kWM8962_SequenceSpeakerWake           = 0xE8U, /*!< speaker wake sequence */
} wm8962_sequence_id_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t WM8962_StartSequence(wm8962_handle_t *handle, wm8962_sequence_id_t id);
/*******************************************************************************
 * Variables
 ******************************************************************************/
/*******************************************************************************
 * Code
 ******************************************************************************/
static status_t WM8962_StartSequence(wm8962_handle_t *handle, wm8962_sequence_id_t id)
{
    uint32_t delayUs      = 93000U;
    uint16_t sequenceStat = 0U;
    status_t ret          = kStatus_Success;

    switch (id)
    {
        case kWM8962_SequenceDACToHeadphonePowerUp:
            delayUs = 93000U;
            break;
        case kWM8962_SequenceAnalogueInputPowerUp:
            delayUs = 75000U;
            break;
        case kWM8962_SequenceChipPowerDown:
            delayUs = 32000U;
            break;
        case kWM8962_SequenceSpeakerSleep:
            delayUs = 2000U;
            break;
        case kWM8962_SequenceSpeakerWake:
            delayUs = 2000U;
            break;
        default:
            delayUs = 93000U;
            break;
    }

    WM8962_CHECK_RET(WM8962_WriteReg(handle, 0x57, 0x20U), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, 0x5A, (uint16_t)id), ret);
    while (delayUs != 0U)
    {
        WM8962_CHECK_RET(WM8962_ReadReg(handle, 0x5D, &sequenceStat), ret);
        if ((sequenceStat & 1U) == 0U)
        {
            break;
        }
        SDK_DelayAtLeastUs(1000U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        delayUs -= 1000U;
    }

    return (sequenceStat & 1U) == 0U ? kStatus_Success : kStatus_Fail;
}

static uint32_t WM8962_GCD_FLL(uint32_t a, uint32_t b)
{
    uint32_t value = 0U;

    while (b != 0U)
    {
        value = a % b;

        a = b;
        b = value;
    }

    return a;
}

static status_t WM8962_GetClockDivider(uint32_t inputClock, uint32_t maxClock, uint16_t *divider)
{
    if ((inputClock >> 2U) > maxClock)
    {
        return kStatus_InvalidArgument;
    }
    else
    {
        /* fll reference clock divider */
        if (inputClock > maxClock)
        {
            if ((inputClock >> 1U) > maxClock)
            {
                *divider = 2U;
            }
            else
            {
                *divider = 1U;
            }
        }
        else
        {
            *divider = 0U;
        }
    }

    return kStatus_Success;
}

static status_t WM8962_SetInternalFllConfig(wm8962_handle_t *handle, const wm8962_fll_clk_config_t *fllConfig)
{
    assert(fllConfig->fllReferenceClockFreq != 0U);

    status_t ret    = kStatus_Success;
    uint16_t refDiv = 0U, fllLock = 0U;
    uint32_t refClock = fllConfig->fllReferenceClockFreq, fllRatio = 0U, outClk = fllConfig->fllOutputFreq,
             fllOutDiv = 0U, fVCO = 0U;
    uint32_t fllGCD = 0U, fllTheta = 0U, fllLambda = 0U, nDivider = 0U, delayUs = WM8962_FLL_LOCK_TIMEOUT;

    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_FLL_CTRL_1, 1U, 0U), ret);
    WM8962_CHECK_RET(WM8962_GetClockDivider(fllConfig->fllReferenceClockFreq, WM8962_FLL_MAX_REFERENCE_CLOCK, &refDiv),
                     ret);

    refClock = fllConfig->fllReferenceClockFreq / (uint32_t)(1UL << (refDiv & 3U));

    if (refClock > 1000000U)
    {
        fllRatio = 0U;
    }
    else if (refClock > 256000U)
    {
        fllRatio = 1U;
    }
    else if (refClock > 128000U)
    {
        fllRatio = 2U;
    }
    else if (refClock > 64000U)
    {
        fllRatio = 3U;
    }
    else
    {
        fllRatio = 4U;
    }

    if ((outClk < 2083300U) && ((outClk > 1875000U)))
    {
        fllOutDiv = 0x2FU;
    }
    else if ((outClk < 3125000U) && ((outClk > 2812500U)))
    {
        fllOutDiv = 0x1FU;
    }
    else if ((outClk < 4166700U) && ((outClk > 3750000U)))
    {
        fllOutDiv = 0x17U;
    }
    else if ((outClk < 6250000U) && ((outClk > 5625000U)))
    {
        fllOutDiv = 0xFU;
    }
    else if ((outClk < 12500000U) && ((outClk > 11250000U)))
    {
        fllOutDiv = 7U;
    }
    else if ((outClk < 20000000U) && ((outClk > 18000000U)))
    {
        fllOutDiv = 4U;
    }
    else if ((outClk < 25000000U) && ((outClk > 22500000U)))
    {
        fllOutDiv = 3U;
    }
    else if ((outClk < 50000000U) && ((outClk > 40000000U)))
    {
        fllOutDiv = 1U;
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    fVCO     = (fllOutDiv + 1U) * outClk;
    nDivider = fVCO / ((uint32_t)(1UL << fllRatio) * refClock);

    fllGCD = WM8962_GCD_FLL((uint32_t)(1UL << fllRatio) * refClock, fVCO);

    fllTheta  = (fVCO - nDivider * (uint32_t)(1UL << fllRatio) * refClock) / fllGCD;
    fllLambda = ((uint32_t)(1UL << fllRatio) * refClock) / fllGCD;

    /* FLL configurations */
    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_FLL_CTRL_2, 0x1FBU, (uint16_t)(refDiv | (fllOutDiv << 3U))), ret);
    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_FLL_CTRL_3, 7U, (uint16_t)fllRatio), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_FLL_CTRL_6, (uint16_t)fllTheta), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_FLL_CTRL_7, (uint16_t)fllLambda), ret);
    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_FLL_CTRL_8, 0x3FFU, (uint16_t)nDivider), ret);
    WM8962_CHECK_RET(
        WM8962_ModifyReg(handle, WM8962_FLL_CTRL_1, 0x65U,
                         (uint16_t)((fllConfig->fllClockSource == kWM8962_FLLClkSourceMCLK ? 0x0UL : 0x20UL) | 0x5UL)),
        ret);

