tokihk/sdbox/env/nxp_mimxrt1170_evkb/system_sdsgw_m7/codec/fsl_wm8962.c
    /* Polling FLL lock status */
    while (delayUs != 0U)
    {
        WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_INT_STATUS_2, &fllLock), ret);
        if ((fllLock & 0x20U) == 0x20U)
        {
            break;
        }
        SDK_DelayAtLeastUs(1000U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
        delayUs -= 1000U;
    }
    ret = ((fllLock & 0x20U) == 0x20U) ? kStatus_Success : kStatus_Fail;

    return ret;
}

static status_t WM8962_SetMasterClock(wm8962_handle_t *handle,
                                      uint32_t dspClock,
                                      uint32_t sampleRate,
                                      uint32_t bitWidth)
{
    uint32_t bitClockDivider = 0U, regDivider = 0U;
    status_t ret = kStatus_Success;

    bitClockDivider = dspClock / (sampleRate * bitWidth * 2U);

    switch (bitClockDivider)
    {
        case 1:
            regDivider = 0U;
            break;
        case 2:
            regDivider = 2U;
            break;
        case 3:
            regDivider = 3U;
            break;
        case 4:
            regDivider = 4U;
            break;
        case 6:
            regDivider = 6U;
            break;
        case 8:
            regDivider = 7U;
            break;
        case 12:
            regDivider = 9U;
            break;
        case 16:
            regDivider = 10U;
            break;
        case 24:
            regDivider = 11U;
            break;
        case 32:
            regDivider = 13U;
            break;

        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    if (ret == kStatus_Success)
    {
        WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_CLOCK2, WM8962_CLOCK2_BCLK_DIV_MASK, (uint16_t)regDivider),
                         ret);
        WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_IFACE2, (uint16_t)(bitWidth * 2U)), ret);
    }

    return ret;
}

status_t WM8962_Init(wm8962_handle_t *handle, const wm8962_config_t *config)
{
    status_t ret = kStatus_Success;

    handle->config = config;
    uint32_t mclk = config->format.mclk_HZ, sysClk = 0U;
    uint16_t clockDiv = 0U;

    /* i2c bus initialization */
    if (CODEC_I2C_Init(handle->i2cHandle, config->i2cConfig.codecI2CInstance, WM8962_I2C_BAUDRATE,
                       config->i2cConfig.codecI2CSourceClock) != (status_t)kStatus_HAL_I2cSuccess)
    {
        return kStatus_Fail;
    }

    /* Reset the codec */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RESET, 0x6243U), ret);
    /* disable internal osc/FLL2/FLL3/FLL*/
    WM8962_CHECK_RET(WM8962_WriteReg(handle, 0x81U, 0), ret);
    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_FLL_CTRL_1, 1U, 0U), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_CLOCK2, 0x9E4), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_POWER1, 0x1FE), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_POWER2, 0x1E0), ret);

    WM8962_CHECK_RET(WM8962_StartSequence(handle, kWM8962_SequenceDACToHeadphonePowerUp), ret);
    WM8962_CHECK_RET(WM8962_StartSequence(handle, kWM8962_SequenceAnalogueInputPowerUp), ret);
    WM8962_CHECK_RET(WM8962_StartSequence(handle, kWM8962_SequenceSpeakerWake), ret);

    /* master clock configuration if it is master */
    if (config->masterSlave && config->sysclkSource == kWM8962_SysClkSourceFLL)
    {
        /* Internal FLL config */
        WM8962_CHECK_RET(WM8962_SetInternalFllConfig(handle, &config->fllClock), ret);
        // WM8962_SetInternalFllConfig(handle, &config->fllClock);
        mclk = config->fllClock.fllOutputFreq;
        /* SYS clock source FLL */
        WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_CLOCK2, 0x20U, 0U), ret);
        WM8962_CHECK_RET(
            WM8962_ModifyReg(handle, WM8962_CLOCK2, (uint16_t)((3U << 9U) | 0x20U), (uint16_t)((1U << 9U) | 0x20U)),
            ret);
    }

    /* DSP clock divider, maximum 24.576MHZ */
    WM8962_CHECK_RET(WM8962_GetClockDivider(mclk, WM8962_MAX_DSP_CLOCK, &clockDiv), ret);
    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_CLOCK1, 3U << 9U, (uint16_t)(clockDiv << 9U)), ret);
    if (config->masterSlave)
    {
        WM8962_CHECK_RET(WM8962_SetMasterClock(handle, mclk / (uint32_t)(1UL << clockDiv), config->format.sampleRate,
                                               config->format.bitWidth),
                         ret);
        WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_IFACE0, 1U << 6U, 1U << 6U), ret);
    }

    /* enable system clock */
    WM8962_CHECK_RET(WM8962_ModifyReg(handle, WM8962_CLOCK2, 0x20U, 0x20U), ret);

    /* sysclk clock divider, maximum 12.288MHZ */
    WM8962_CHECK_RET(WM8962_ReadReg(handle, WM8962_CLOCK1, &clockDiv), ret);
    sysClk = mclk / (1UL << (clockDiv & 3U));

    /* set data route */
    WM8962_CHECK_RET(WM8962_SetDataRoute(handle, &config->route), ret);
    /* set data protocol */
    WM8962_CHECK_RET(WM8962_SetProtocol(handle, config->bus), ret);
    /*
     * ADC volume, 0dB
     */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LADC, 0x1C0), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RADC, 0x1C0), ret);
    /*
     * Digital DAC volume, -15.5dB
     */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LDAC, 0x1C0), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RDAC, 0x1C0), ret);
    /* speaker volume 6dB */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT2, 0x1ff), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT2, 0x1ff), ret);
    /* input PGA volume */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LINVOL, 0x13F), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_RINVOL, 0x13F), ret);
    /* Headphone volume */
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_LOUT1, 0x16B), ret);
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ROUT1, 0x16B), ret);
    WM8962_CHECK_RET(WM8962_ConfigDataFormat(handle, sysClk, config->format.sampleRate, config->format.bitWidth), ret);

    return ret;
}

status_t WM8962_Deinit(wm8962_handle_t *handle)
{
    status_t ret = kStatus_Success;

    /* power down */
    WM8962_CHECK_RET(WM8962_StartSequence(handle, kWM8962_SequenceChipPowerDown), ret);

    return ret;
}

status_t WM8962_SetProtocol(wm8962_handle_t *handle, wm8962_protocol_t protocol)
{
    status_t ret = kStatus_Success;

