tokihk/sdbox/env/nxp_mimxrt1170_evkb/system_sdsgw_m7/codec/fsl_wm8962.c
    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_ADDCTL3, val), retval);

    switch (ratio)
    {
        case 64:
            val = 0x00U;
            break;
        case 128:
            val = 0x02U;
            break;
        case 192:
            val = 0x04U;
            break;
        case 256:
            val = 0x06U;
            break;
        case 384:
            val = 0x08U;
            break;
        case 512:
            val = 0x0AU;
            break;
        case 768:
            val = 0x0CU;
            break;
        case 1024:
            val = 0x0EU;
            break;
        case 1536:
            val = 0x12U;
            break;
        case 3072:
            val = 0x14U;
            break;
        case 6144:
            val = 0x16U;
            break;
        default:
            retval = kStatus_InvalidArgument;
            break;
    }

    if (kStatus_Success != retval)
    {
        return retval;
    }

    WM8962_CHECK_RET(WM8962_WriteReg(handle, WM8962_CLK4, val), retval);

    return retval;
}

status_t WM8962_WriteReg(wm8962_handle_t *handle, uint16_t reg, uint16_t val)
{
    uint16_t buff = (uint16_t)(WM8962_SWAP_UINT16_BYTE_SEQUENCE(val) & 0xFFFFU);

    return CODEC_I2C_Send(handle->i2cHandle, handle->config->slaveAddress, reg, 2U, (uint8_t *)(uintptr_t)&buff, 2U);
}

status_t WM8962_ReadReg(wm8962_handle_t *handle, uint16_t reg, uint16_t *val)
{
    status_t retval    = 0;
    uint16_t readValue = 0U;

    retval = CODEC_I2C_Receive(handle->i2cHandle, handle->config->slaveAddress, reg, 2U, (uint8_t *)&readValue, 2U);
    if (retval == kStatus_Success)
    {
        *val = WM8962_SWAP_UINT16_BYTE_SEQUENCE(readValue);
    }
    return retval;
}

status_t WM8962_ModifyReg(wm8962_handle_t *handle, uint16_t reg, uint16_t mask, uint16_t val)
{
    status_t retval  = 0;
    uint16_t reg_val = 0;
    retval           = WM8962_ReadReg(handle, reg, &reg_val);
    if (retval != kStatus_Success)
    {
        return kStatus_Fail;
    }
    reg_val &= (uint16_t)~mask;
    reg_val |= val;
    retval = WM8962_WriteReg(handle, reg, reg_val);
    if (retval != kStatus_Success)
    {
        return kStatus_Fail;
    }
    return kStatus_Success;
}

#if DEBUG_WM8962_REGISTER
void WM8962_ReadAllReg(wm8962_handle_t *handle, uint32_t endAddress)
{
    status_t retval    = 0;
    uint16_t readValue = 0U, i = 0U;

    for (i = 0U; i < endAddress; i++)
    {
        retval = CODEC_I2C_Receive(handle->i2cHandle, handle->config->slaveAddress, i, 2U, (uint8_t *)&readValue, 2U);
        if (retval == kStatus_Success)
        {
            PRINTF("REG %x, value %x\r\n", i, WM8962_SWAP_UINT16_BYTE_SEQUENCE(readValue));
        }
        else
        {
            assert(false);
        }
    }
}
#endif
